<!-- dflook/terraform-github-actions {"workspace":"colours-test","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"8fe8ef291e1419d56f70cc803e7b4d6628390844fd9cc2c07e57f428663866c7","plan_job_ref":"Job Test plan target and replace #348 at https://github.com/dflook/terraform-github-actions/actions/runs/5417009077","plan_hash":"5a67f66a5dcfa4a4b4c3385ee760e45c063378c252bbdf443a88c25601039008","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __colours-test__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "gAMFN1VLyP" -> (known after apply)
  ~ foreach = "Y6M33BpqfZ" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #348](https://github.com/dflook/terraform-github-actions/actions/runs/5417009077)